const HOTEL_STEPS = [
  {
    id: 1,
    text1: "입·퇴실 날짜 선택",
    text2: "반려견의 체크인과 체크아웃 날짜를 선택해주세요.",
  },
  {
    id: 2,
    text1: "퇴실 시간 연장 여부 선택",
    text2: "필요하다면 퇴실 시간을 연장할 수 있어요. ",
  },
  {
    id: 3,
    text1: "강아지 견종 선택",
    text2: "소형견 · 중형견 · 대형견 중 하나를 선택해주세요.",
  },
  {
    id: 4,
    text1: "호텔링 중 미용 예약 옵션",
    text2: " 숙박 중 미용 서비스도 함께 예약할 수 있어요.",
  },
  {
    id: 5,
    text1: "요청사항 & 안내 확인",
    text2: "요청사항을 입력하고 안내사항에 동의해주세요",
  },
];

const Steps = ({ type }) => {
  let data = [];
  switch (type) {
    case "hotel":
      data = HOTEL_STEPS;
      break;
  }
  return (
    <ul className="steps">
      {data.map((el) => (
        <li key={el.id}>
          {/* <i className="none">{el.id}</i> */}
          <i>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="16"
              height="12"
              viewBox="0 0 16 12"
              fill="none"
            >
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M15.1707 0.929962C15.3814 1.1409 15.4998 1.42684 15.4998 1.72496C15.4998 2.02309 15.3814 2.30902 15.1707 2.51996L6.02524 11.6655C5.91966 11.7709 5.79415 11.8544 5.65602 11.9108C5.51789 11.9673 5.3699 11.9958 5.22067 11.9945C5.07143 11.9933 4.92394 11.9623 4.78678 11.9035C4.64962 11.8447 4.52553 11.7592 4.42174 11.652L0.817243 7.92596C0.70923 7.82092 0.623417 7.69526 0.564895 7.55642C0.506374 7.41758 0.476336 7.26841 0.476564 7.11774C0.476792 6.96708 0.507281 6.81799 0.566223 6.67933C0.625165 6.54068 0.711358 6.41527 0.819688 6.31056C0.928019 6.20585 1.05628 6.12396 1.19686 6.06976C1.33744 6.01556 1.48747 5.99015 1.63806 5.99504C1.78864 5.99993 1.93671 6.03501 2.07348 6.09821C2.21025 6.16141 2.33293 6.25144 2.43424 6.36296L5.24374 9.26546L13.5807 0.929962C13.7917 0.719286 14.0776 0.600952 14.3757 0.600952C14.6739 0.600952 14.9598 0.719286 15.1707 0.929962Z"
                fill="#FEFEFE"
              />
            </svg>
          </i>
          <div className="context">
            <span className="text1">{el.text1}</span>
            <span className="text2">{el.text2}</span>
          </div>
        </li>
      ))}
    </ul>
  );
};

export default Steps;
